{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "tutorials",
      "patterns": [
        "Are there video tutorials?",
        "Is there a video tutorial online help?",
        "Are there video tutorials?",
        "I need help",
        "I don't remember how the backoffice works",
        "Can we have training at the back office?",
        "How to understand the functioning of the back office?"
      ],
      "responses": [
        "Yes, to date there are 3 Youtube playlists",
        "Yes, you have videos in French and in English",
        "Yes, to date there are over 50 online help videos"
      ]
    },
    {
      "tag": "feedback",
      "patterns": [
        "Shall we ask a question?",
        "I saw a bug",
        "How do I report a bug?",
        "I want to report a bug",
        "There is something that doesn't work",
        "Is there a method for reporting a bug?",
        "How do we report a bug?",
        "How do we report a bug?"
      ],
      "responses": [
        "Yes, you can send us an email with your question",
        "Yes, for bugs send us an email",
        "Yes, if you see a bug you can report it to us by email.",
        "Yes, send an email with your question with a short explanation, ie no more than 5 lines to describe your problem."
      ]
    },
    {
      "tag": "frontend",
      "patterns": [
        "As an author, why is my name not clickable on the website?",
        "As an author, why do I have neither a photo nor my twitter account on my tag result page on the Website?",
        "As an author, why don't I see all my content creations (articles, editions) attached to my name?",
        "As an author, I do not see the content in my name",
        "Where is my author page?",
        "As an author, where am I on the front site?",
        "As an author, I want a link on my name",
        "Is it possible to add your twitter account",
        "Is it possible to add your facebook account",
        "Why does my author page not have good SEO",
        "Where can I put my biography?",
        "I can't find myself in Google by typing my name",
        "In search engines like Google you can find me",
        "My referencing on the site sucks"
      ],
      "responses": [
        "As an author, you must create a TagMetadata type content attached to your name (Author Tag).",
        "For SEO, by creating TagMetadata type content in the backoffice attached to your name (Author Tag), your name will become clickable.",
        "To create a TagMetadata type content, you must have the ADMINISTRATOR role in the backoffice.",
        "Your name is now clickable because you have created and attached a TagMetadata type content to your author tag.",
        "You can now expand your TagMetadata page with your Twitter account, a biography and a photo.",
        "Once saved, all of these will then appear on your author tag result page with the content attached to your name.",
        "Historically, it is possible that two author tags exist.",
        "You must therefore transfer all the content attached to a tag to the tag you want to keep using the tag merge tool.",
        "Only administrators have access to this tag merge feature."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye"
      ],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thank's a lot!"
      ],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure"
      ]
    }
  ]
}